# ViewShowHiddenLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewShowHiddenLines Property
ParameterTypeId Class See Also
---
"Show Hidden Lines"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewShowHiddenLines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewShowHiddenLines As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewShowHiddenLines {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace